In [11]:
import pandas as pd
import numpy as np

In [12]:
data = np.random.randn(4,4)
data

array([[-1.60795032, -1.477853  ,  0.98270676, -0.07798212],
       [-0.9529377 ,  2.37293587,  0.3632271 ,  0.26044637],
       [ 0.76508373, -0.89840477,  0.67267097,  0.43135919],
       [-0.48364559, -1.29692546, -0.05948377,  1.97254783]])

In [13]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2         3
0 -1.607950 -1.477853  0.982707 -0.077982
1 -0.952938  2.372936  0.363227  0.260446
2  0.765084 -0.898405  0.672671  0.431359
3 -0.483646 -1.296925 -0.059484  1.972548

In [14]:
type(dataFrame)

pandas.core.frame.DataFrame

In [15]:
yenidtfr = pd.DataFrame(data,index=["a","b","c","d"],columns=["MAAS","ÜCRET","ÖDENEK","EDERİ"])#datafrme yazdık.

In [16]:
yenidtfr

       MAAS     ÜCRET    ÖDENEK     EDERİ
a -1.607950 -1.477853  0.982707 -0.077982
b -0.952938  2.372936  0.363227  0.260446
c  0.765084 -0.898405  0.672671  0.431359
d -0.483646 -1.296925 -0.059484  1.972548

In [17]:
yenidtfr["MAAS"]

a   -1.607950
b   -0.952938
c    0.765084
d   -0.483646
Name: MAAS, dtype: float64

In [18]:
yenidtfr[["ÖDENEK","EDERİ"]]

     ÖDENEK     EDERİ
a  0.982707 -0.077982
b  0.363227  0.260446
c  0.672671  0.431359
d -0.059484  1.972548

In [19]:
yenidtfr.loc["c"]  #row ları getirmek istersek.

MAAS      0.765084
ÜCRET    -0.898405
ÖDENEK    0.672671
EDERİ     0.431359
Name: c, dtype: float64

In [20]:
yenidtfr.iloc[1] #İNDEX BAZLI ROW GETİRME...

MAAS     -0.952938
ÜCRET     2.372936
ÖDENEK    0.363227
EDERİ     0.260446
Name: b, dtype: float64

In [21]:
yenidtfr

       MAAS     ÜCRET    ÖDENEK     EDERİ
a -1.607950 -1.477853  0.982707 -0.077982
b -0.952938  2.372936  0.363227  0.260446
c  0.765084 -0.898405  0.672671  0.431359
d -0.483646 -1.296925 -0.059484  1.972548

In [22]:
yenidtfr["ZAMAN"]= yenidtfr["ÜCRET"]+yenidtfr["EDERİ"] #yeni kolon ekleme

In [23]:
yenidtfr

       MAAS     ÜCRET    ÖDENEK     EDERİ     ZAMAN
a -1.607950 -1.477853  0.982707 -0.077982 -1.555835
b -0.952938  2.372936  0.363227  0.260446  2.633382
c  0.765084 -0.898405  0.672671  0.431359 -0.467046
d -0.483646 -1.296925 -0.059484  1.972548  0.675622

In [24]:
yenidtfr.drop("EDERİ", axis = 1)

       MAAS     ÜCRET    ÖDENEK     ZAMAN
a -1.607950 -1.477853  0.982707 -1.555835
b -0.952938  2.372936  0.363227  2.633382
c  0.765084 -0.898405  0.672671 -0.467046
d -0.483646 -1.296925 -0.059484  0.675622

In [25]:
yenidtfr

       MAAS     ÜCRET    ÖDENEK     EDERİ     ZAMAN
a -1.607950 -1.477853  0.982707 -0.077982 -1.555835
b -0.952938  2.372936  0.363227  0.260446  2.633382
c  0.765084 -0.898405  0.672671  0.431359 -0.467046
d -0.483646 -1.296925 -0.059484  1.972548  0.675622

In [26]:
yenidtfr.drop("d", axis = 0) #satır row silme

       MAAS     ÜCRET    ÖDENEK     EDERİ     ZAMAN
a -1.607950 -1.477853  0.982707 -0.077982 -1.555835
b -0.952938  2.372936  0.363227  0.260446  2.633382
c  0.765084 -0.898405  0.672671  0.431359 -0.467046

In [27]:
yenidtfr.drop("b") #satır, row silem

       MAAS     ÜCRET    ÖDENEK     EDERİ     ZAMAN
a -1.607950 -1.477853  0.982707 -0.077982 -1.555835
c  0.765084 -0.898405  0.672671  0.431359 -0.467046
d -0.483646 -1.296925 -0.059484  1.972548  0.675622

In [28]:
#datafrma üzerinde yaptıgımız işlemin kalıcı olması için bunu belirtmemiz lazım
#İNPLACE DEGERİNİ tRUE YAORSAK YAPTGMZ İŞLEM KALICI OLUR.

In [29]:
yenidtfr.drop("EDERİ", axis = 1,inplace = True)

In [30]:
yenidtfr #artık ederi silindi.

       MAAS     ÜCRET    ÖDENEK     ZAMAN
a -1.607950 -1.477853  0.982707 -1.555835
b -0.952938  2.372936  0.363227  2.633382
c  0.765084 -0.898405  0.672671 -0.467046
d -0.483646 -1.296925 -0.059484  0.675622

In [31]:
yenidtfr.loc["c"]["MAAS"] #SATIRDAN NOKTA BULMA 1.YONTEM

0.765083726659813

In [32]:
yenidtfr.loc["b","ÖDENEK"] #SATIRDAN NOKTA BULMA 2.YÖNTEM

0.3632270978770129

In [33]:
yenidtfr

       MAAS     ÜCRET    ÖDENEK     ZAMAN
a -1.607950 -1.477853  0.982707 -1.555835
b -0.952938  2.372936  0.363227  2.633382
c  0.765084 -0.898405  0.672671 -0.467046
d -0.483646 -1.296925 -0.059484  0.675622

In [34]:
yenidtfr <0

    MAAS  ÜCRET  ÖDENEK  ZAMAN
a   True   True   False   True
b   True  False   False  False
c  False   True   False   True
d   True   True    True  False

In [35]:
yenidtfr[yenidtfr <0] #df içinde sıfıdan küçük olanları gösterme

       MAAS     ÜCRET    ÖDENEK     ZAMAN
a -1.607950 -1.477853       NaN -1.555835
b -0.952938       NaN       NaN       NaN
c       NaN -0.898405       NaN -0.467046
d -0.483646 -1.296925 -0.059484       NaN

In [36]:
yenidtfr["ÜCRET"]>0

a    False
b     True
c    False
d    False
Name: ÜCRET, dtype: bool

In [37]:
yenidtfr[yenidtfr["ÜCRET"]>0]

       MAAS     ÜCRET    ÖDENEK     ZAMAN
b -0.952938  2.372936  0.363227  2.633382

In [38]:
yenidtfr[yenidtfr["MAAS"]>0]

       MAAS     ÜCRET    ÖDENEK     ZAMAN
c  0.765084 -0.898405  0.672671 -0.467046